# EA_DataAccMtrlDlg

## Description
Shows the lambda material dialog and set the selected lambda value to outLambda.

```pascal
FUNCTION EA_DataAccMtrlDlg(
				acc           : INTEGER;
				VAR outLambda : REAL): BOOLEAN;
```

```python
def vs.EA_DataAccMtrlDlg(acc):
    return (BOOLEAN, outLambda)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|acc|INTEGER|   |
|outLambda|REAL|   |

## Version
Availability: from Vectorworks 2016

## Category
* EnergyAnalysis Interface Library